bjjplan.org
#+TITLE:
#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css"/>

This page was created in 2017 and shortly thereafter abandoned. I wanted to learn how to make a webpage with Emacs and OrgMode. This does work so that suceeded. I am going to change this shortly into something else that is a directory for the subdomains. This domain is just my last name and I have email addresses setup as well.

The following is my current gameplan for bjj. This is mostly based on notes I have made from BJJ classes and outside sources. My idea is to actually take the lessons I learn and videos I watch seriously and drill those specific techniques instead of just collecting and forgetting move after move.

I use the term OP and OPs for opponent for shorthand. I am not sure if my notes make sense to anyone but me, but you are free to use what you find useful.

This page is written in [[https://www.gnu.org/software/emacs/][GNU Emacs]] and [[http://orgmode.org/][Org-Mode]] and it is a way to combine two of my hobbies/obsessions. The html for this site is auto generated as I update my notes. This site is hosted on github and these files can be downloaded from [[https://github.com/bcronmiller/][my github page]].

#+TOC: headlines 2

* Guard
** Top Guard
***** Open Guard
****** [[https://www.youtube.com/watch?v=APzRFmKyIhQ][Passing Open Guard -josh robinson]]

In this link from Ronin Submissions Josh Robinson, Josh explains how to establish a good position from open guard before allowing the opponent to control your hips or sleeves. Step one is to establish a knee ride on the thigh of the opponent and allow the knee shield. This immobilizes the hips and stops inversions. Step two is to connect your hands and arms under the thighs and pass to one side or the other.
***** Closed Guard Passing
****** [[https://www.youtube.com/watch?v=DZL7pmQjmyU&list=PLLvUtPaoHJDIXWuF18ZKOC-HNdNhuMqks&index=2][Basic Guard Passing System (VanGuard Gym Coach Doug)]]
******* Basic Guard Break (Guard Break)
******** Double Meathead Pass
After the Basic Guard break you have moved away from OPs hips. This allows OP to put his feet on your hips and create space and control.
The Double Meathead Pass answers this problem. Your arms pummel under the OPs legs and you connect your hands in front of his hips.
This pops OPs feet off of your hips.
Next, pull OP up on your lap to isoloate OPs hips. Grab the far side lapel in the direction you want to pass.
Stand up and drive into the legs as you walk around to the side.
Drive your shoulder into the legs with good posture to pass.
The far side lapel grip will prevent the OP from rolling away.

Note: Doug recommends not grabbing the collar. (This is what I do most times). The collar grab opens you up to the elbow push escape while the lower lapel grip controls the hips better and is not as suseptable to the elbow push because your arm is not as extended.
******** Shoulder in Belly Pass (Over/Under pass)
From the break, You grab one pant grip at OPs knee and the other arm underhooks the leg.
Keep both grips while you drop your shoulder into OPs missection and walk around the guard.
After your knee is established on the hip you are cleared to move the knee grip to a crossface control of the neck.
After that is established you can release the underhook of the leg to secure side control.
Note: You are on your toes and not your knees during this pass
******* Violator/Combat Knee Break
From closed guard establish double bicep control on the OPs closed guard. Stand up and stack the OPs guard.
While standing adjust your feet so that your knee is lined up on OPs centerline.
Sit back into a combat base (forward leg knee up, back knee down)
This will break the guard open and leave you in a good base situation.
Depending on which way OPs shirmps or what side he leans to we will use either Knee Thru or Knee Slice Pass
******** Knee Thru Pass
Knee Thru means that we staple our knee over the OPs thigh on the same side (Right to Right, Left to Left)
1. As OP shrimps we staple the leg with our forward knee
2. At the same time, we reach for a crossface control of the neck and underhook OPs farside leg
3. Pin your knee to control the near side hip
4. Backstep with strong shoulder pressure and a deep crossface grabbing the back of the gi
4a. Extend your hips into the armpit to dominate the side
5. Replace your knee on the hip with your top side hand
6. Switch your knee from the hip to the armpit while pressing OPs face away with shoulder pressure.
******** Cross Knee Pass (Knee Slice Pass)
Cross Knee means we are going from Right to Left or Left to Right with the knee across OPs hips. The key to this pass is to get the underhook on the same side as our knee is coming from to avoid a backtake.
1. As OP shrimps we staple across to the opposite side of our knee.
2. Underhook the far side armpit while pulling up on the near side sleeve
3. Step around OPs bottom leg as you baseball slide into the pass with full pressure on your OP.
4. End at [[*Top][Scarf Control Top]
