bjjplan.org
******** Turk Pass (Leg Weave)
From OPs scissor guard (open guard with a setup for a scissor sweep, knee sheild top leg with a bottom leg outside my legs.
1. Weave your arm under the knee of the knee shield and grip on top of OPs bottom knee.
2. Get to your feet and stack into OP
3. Press forehead and shoulders down and forward to collapse OPs legs together
4. As you press your shoulder into OP, spring up and hop around the legs.
This kills OPs hips and limit his movement
5. Turn the leg weave hand the other way to make room at OPs hips
6. Place your bottom knee into the hip and finish the pass.
7. If OP gets the top knee in between before you finish the pass. Use the leg weave hand to cup the top knee fast and pull it away while you replace your knee and finish the pass.
8. If OPs legs are preventing the pass, keep the same grips and hop to the back side to finish the pass.
** Bottom Guard
***** Overhook Guard game
****** Vale Tudo Guard
******* [[https://www.youtube.com/watch?v=CGDdWRRtGDw][Vale Tudo Guard Vale Tudo Guard -josh robinson]] (similar to my overhook game with a better setup)

Josh explains that you would use your wrists connecting to the back of the neck to break posture instead of pulling collars. I like this because I am getting spiderguard fingers from pulling lapels so if I can be less dependant on those grips it will be better for my hands. I will be able to use my grips for chokes instead of breaking posture as well. It also has the benefit of being able to translate to a no-gi game.

******* [[https://www.youtube.com/watch?v=1t_0crasE_4][Vale Tudo Guard no-gi -josh robinson]] (setup triangle, gogoplata and straight jacket)

In this video Josh explains how to setup the Vale Tudo guard (from the hip instead of being flat on the back). Bicep control is better than wrist control. Feet on hips can be exchanged for a formal closed guard. The overhook keeps the posture broken with a collar tie at times. "Clear the head" means we get the forearm to the overhook side and the foot comes in front for a gogoplata. The triange is available because you are on your hip. The straightjacket submission follows the gogoplata setup when the arm defends the choke. The far arm is pulled through to increase pressure on the choke. This is similar to the collar choke with the far arm pulled across to allow the shoulder to finish the choke. This also leads to an omaplata choke.
******* [[https://www.youtube.com/watch?v=X8Qhl-jmeNs][Closed Guard Arm-drag (Roger Gracie Guard Study)]] (Arm-drag with 2 on 1 grip to setup, back-take, armbar or flower sweep)
The guard is closed and you grab the ops sleve at the wrist and elbow. Using a bridge and a foot on the arm side hip, pull the elbow across your centerline to pin it the side. When the elbow is across teh centerline, three options are available depending on what the op does. 1. take the back 2. arm bar (scrambles into triangle, oomaplata etc) 3. sweep (flower sweep shown in the video)
******** Back-Take
The backtake is availble by pushing the arm away from your center line as you crawl to the back. Be careful to not fall too far forward. In the video, Roger uses an underhook on the legs and strong collar control to stay tight to the op. Roger also tries to hand off the sleeve grip to the far side hand from the armpit. This creates a strong "gift-wrap" style grip around the back and it helps the back take.
******** Arm Bar
The op will raise the head to avoid the backtake. Additionally the op will extend thier neck and use head pressue to prevent the backtake. When this happens, it is possible to go for the armbar instead. If the armbar fails be ready to scramble into the sweep, triangle or oomaplata. Before transitioning from the back take to the armbar, it is nessesary to get your hips out to the side. Roger also sets up the armbar with a far side collar grip. This allows him to anchor and helps get the foot in front of the face. It may also be useful if an opportunity for a choke happens. Keep the back take threat alive while setting up the armbar.

When Roger broke Jacare's arm he climbed his legs up into a high guard that covered the far side shoulder before he committed to the armbar. This allowed Jacare less time to react to the armbar before it was secured.
******** Flower-sweep
The control of the arm that comes with the 2 on 1 sleeve grip will deprive op of base on that side. The example of Roger using the flower sweep in this video is the same climbing guard that Roger used to armbar Jacare. The op had nee raised on the same side as the 2 on 1 arm that Roger controlled. While climbing up and threatening the armbar, Roger used the movement to underhook the ops far side leg (opposite of the controlled arm) and swept to mount. This would have worked with a gi grip as well if he could not get the underhook on the leg.
******* [[https://www.youtube.com/watch?v=FP-qEk83DdQ][Cross-side collar grip (Kron Gracie Guard Study) loopchoke, armbar, anklepick]]
***** [[https://www.youtube.com/watch?annotation_id=annotation_263863977&feature=iv&src_vid=8F6meOljv-s&v=tmGqgXnuNBE][Marcelo Garcia elbow push escape (Guard Rete
* Half-Guard
** Top Half
** Bottom Half
*** [[https://youtu.be/X8Qhl-jmeNs?t=8m34s][Half-Guard roll from bottom to top (Roger Gracie Guard Study)]]
**** From Bottom Half-Guard get perpendicular and reverse the position
Roger gets an overhook on the trapped leg side from bottom half-guard. He is on his side with contol of the belt with his top hand and a unknown grip with his bottom hand. He could have the leg or hip. He plants his outside foot and upas hard while pulling up on the belt to get the ops weight foward while Roger gets his body perpendicular. He uses momentum before the upa to load the op and get him moving in the correct direction. Roger also uses the momentum from the upa to swing his outside leg up as he inverts into the roll
* Side Control
** Top Side
*** [[https://www.youtube.com/watch?v=S1NpPbMGJ6I&feature=youtu.be][Rafael Lovato Jr's Kimura Secrets]] (Thanks Phil)              :bottomside:
**** Notes
 From Side Control Top with an Underhook on the far arm
 1. Pin the near arm under your shin by first pushing the arm down
 2. Windshield Wiper your legs to switch to your other leg and begin to move to North/South
 3. Step over and pull OP to his side to setup the North/South position
 4. Keep a strong underhook on the far arm and put weight on the arm
 5. Step over and settle into the North/South
 6. Use a "mouse trap" move to switch the grip for the Kimura and use the grip at the hand so the wrist lock is available. Make sure you use a no thumb "monkey grip". Using thumbs makes is possible to lose the arm. (I like the wrist lock option to help break the grip)
 7. Lean forward to setup the grip break instead of just using your arms. Use the torso turn to break the grip and move the arm instead of using your arms
 8. Move the arm away up and then behind the back to finish the submission.
** Bottom Side
[[https://www.youtube.com/watch?v=8F6meOljv-s&index=1&list=PLLvUtPaoHJDIXWuF18ZKOC-HNdNhuMqks][Side Control system from VanGuard Gym (Coach Doug Esposito)]]
It is easy to defend if you only try to re-guard. You need to have various options for different situations. This system will give you a plan for escapes.

