bjjplan.org
*** Stone Squirrel Posture [[https://www.youtube.com/watch?v=8F6meOljv-s&index=1&list=PLLvUtPaoHJDIXWuF18ZKOC-HNdNhuMqks][VanGuard side contol escape system]]

The stone squirrel posture is a position from bottom side control. Your hands
control the opponents shoulder and your forearms and elbows frame in between
your chest and your opponent's chest. This frame allows you to raise your arms
over your head (trash truck style) to bring your opponent away from your chest.
Putting your forearms on the chest instead of on the neck gives you more
control. When combined with a bridge space is created that can be used in the positions that follow.

**** Re-Guard

From Stone Squirrel, feet close to hips, bridge into op and lift op back with a
frame. At the same time, shrimp to make room and insert a knee to take up the
space you created. Hook behind the leg or under the leg for a butterfly to re-guard
****** Sweep
If you have the overhook control from the guard and the ops posture is broken, you can sweep from guard to mount.
****** Armbar
If you have a stong underhook on the other arm an armbar is available from the guard with your arm and head pinching the elbow of your opponent.
**** Bottom Single Leg to Side Control – Top/Offensive

From Stone Squirrel, frame with your forearms and elbows and bridge. Ensure that
your feet are not all the way into your hips, that space is needed to "hip
heist". Hip Heist means you thread your nearside foot under your far side leg
and turn belly down. At the same time, windshield wiper and pummel your far side arm to
create an underhook

**** Bump and Roll to Side Control – Top/Offensive
With one arm framed on the hip and the other arm under the chest in stone squirrel, lift and upa into the op to make room for your guard. The op is pressing back to flatten you out. Using this momentum, scoot your hips underneath your op with a hip shovel (do not just roll without getting under the op). The frame on the hip is key to making this work.
***** If OP posts on his hand
The posting opens the OP up so that we can try to reguard or move into another transition. We have to drill all of these defenses so we can link one technique to the others in the system.
**** Rainbow Roll to Side Control – Top/Offensive
The crossface from side control gives us an opportnity to trap that arm. If we can get parrell to the OP we can roll to sweep to top side control from that posistion. This happens naturally when OP is going to North South If we feel the bottom arm transerring to 100 kilos that is a cue that OP is going to North/South. Otherwise, we can move ourselves into a North/South posture to get OP "on a line" by changing the angle. Our hand that is not trapping the crossface arm is going over OPs back to grab his belt. We have to shrimp away from OP and put your armpit on OPs shoulder.
*** Armpit/Prayer Posture (APP)
Armpit/Prayer Posture is similar to Stone Squirrel. The farside hand is in the armpit instead of being at the shoulder. This makes it harder to peek your elbow out for the far side underhook but it allows access to the top single leg. HipBump to move farside hand under the armpit.
**** Top Leg Single to Side Control – Top/Offensive
From APP, bump and shrimp to get rid of the crossface and make OP "float" on your forearms by lifting your forearms to fill the space you created with the bump.
**** Elbow Push to Open Guard
**** All Stone Squirrel Escapes
*** Hands in Front Posture
**** Turn Away to Turtle 1 – Bottom/Defensive, sit thru to Turtle 2 – Top Offensive
**** Monkey or Granby Roll to Bottom Guard
*** Inside Arm Down Posture
**** Pant Grab to Guard or Half-Guard – Bottom
**** Jail Break to Butterfly Guard – Bottom
**** Ghost to Turtle 1 – Top/Offensive
*** Submissions from Bottom
**** [[https://www.youtube.com/watch?v=HLcM9pbELHk][no-gi baseballbat and ezekiel from bottom - josh robinson]]
**** Last resort                                                :subs:bottom:
SCHEDULED: <2016-11-26 Sat>
:PROPERTIES:
:CREATED:  [2016-11-26 Sat 17:14]
:END:

You should try for escapes instead of submissions from inferior positions. We cannot assume that every encounter will be 1 on 1 in a controlled environment. Being in top position gives you a better chance to bail out and run if nessesary.

* Scarf
** Top Scarf
**** TODO [[https://www.youtube.com/watch?v=efox3xBLk50][Josh Robinson Side Control flow from Kesa Katame (with underhook)]] (Stopped at 3:56 on notes - pick up from here)
From side control immediately sit through to the underhook Kesa Katame (scarf hold) with or without the underhook
Staying in side control will be met with a lot of squirming so scarf hold is better
***** Modified Kesa Katame (with underhook)
1. Step over the head right away and look for the armpit armbar on the near side arm In order to sit through, post on your far elbow and pull under his near side elbow to get him to turn. This makes your legs light enought to step over the head. The sitthrough and stepover should be a one two punch.
2. Op pushes the leg away
3. Step back while following the arm to setup a modified gift wrap (Big Rich style) apply pressure for a choke. (similar to the arm triangle)
4. From Big Rich gift wrap, place your bottom side arm on the other side of OPs face to setup the straight armbar
5. Setup the wrist lock from here
6. If OP fights that off, follow the wrist to to setup the keylock (americana arm lock) Make sure to step over the shoulder for the americana, do not stay flat.
***** Kesa Katame (judo style without underhook)

** Bottom Scarf

* North/South
** Top NS
** Bottom NS
* Knee on Belly
** Top KOB
** Bottom KOB
* Back
** Top Back
** Bottom Back
* Mount
** Top Mount
** Bottom Mount
* CACC Notes
** From Billy Riley documentary [[https://youtu.be/wqq_LWudBek?t=4m23s][Billy Riley teaches turtle attack]]
From Turtle with a forearm on the ground.
1. Grab the far arm from under the armpit to control that side
2. With the other hand, push OPs head down to the ground
3. Swing your topside leg over the head and pull as you fall to that side
4. Post on the far arm as you fall so you do not flop to your side but you are upright and ready
5. This will roll OP over and you still have the arm
6. This can lead to topside position or a reverse triangle based on having the head and arm trapped.

Later in the same video is a good fireman throw followed through to side control
** TODO Eric Paulson [[https://www.youtube.com/watch?v=Y_B7Wd4LF28&feature=youtu.be][4 Catch Wrestling Moves]]
   Add notes later

* Notes
** Concepts
*** On a line
Coach Doug uses the term On a line in his side control series. This means that the OP is in a position that does not allow him to base on one side. In judo this can be called a dead angle.
*** Hip Heist
*** Stone Squirrel
*** Top Single leg
Closest to your head instead of closest to your hips
*** Bottom Single leg
Closest to your hips instead of your head. You need to hip heist to get this leg.
** Styles
*** [[https://www.jiujitsutimes.com/purple-belt-k-rolling-belt/][How to Roll as a purple belt]] by Eddie Fyvie
**** Crush you opponents: Focus on using heavy weight and really “crushing” on top.
**** Don’t finish anyone: Try to roll in a way where you catch and release submissions. Focus mainly on positions.
**** Don’t give anything: Don’t give an inch to anyone.
**** Keep it playful, but with a purpose: Keep it playful, but adhere to the principles and pick a goal.
**** Float: Don’t hold positions long; hop around and move quickly.
