bjjplan.md

6.  Allow bad positions, but with a purpose: Allow bad positions with the purpose of escaping and defending. Find comfort in discomfort.

7.  Go for a “marathon round”: Just roll. Roll so long you have to change your attire. Time limits = sport. No time limits = life

8.  Trade moves for concepts

    You should be utilizing the principles and concepts passed down by our BJJ forefathers from DAY ONE of your training!

    However, at the purple belt, it is time to kick your understanding of concepts into high gear.

    Imagine it like art; white belt and blue belt are learning how the artists’ tools work. You learn how to draw, paint, sketch, and at the end of blue belt, you have picked your “style” of art. The white belt and blue belt level doesn’t allow much room for personal thought. You need a concrete foundation and must master the artists’ tools!

    When you reach purple belt, you have earned the right to start exploring the “abstract”. You should always experiment and stay fascinated by the difficulty!

    “You can listen to me now or wait until you are 65.” – Frank Popolizio

    You are now freeing yourself from the stress of mastering the basics and can start opening up and allowing the abstract form of rolling to take shape. You should be seeing the “big picture” of jiu-jitsu much more clearly and have blended the hundreds of techniques you know into concepts that allow you to start applying them rapidly. You must see the “blend” of techniques in the various situations.

    The figurative samurai sword has been sharpened once you hit black belt. The purple belt has acquired the sword and has the skills, but still needs to smooth out the blade for extreme precision.


<a id="org412b855"></a>

## TrumpetDan Brownbelt Series

TrumpetDan is a great teacher and these videos are full of great technical details that need to be mined. I remember watching these videos when I was a whitebelt and this information was mostly above my head. Other things in these vidoes are things I only just realized I learned from this video series. They are just things I have done for the last 4 years.


<a id="orgf99fae3"></a>

### [TD Brownbelt Series Part 1](https://www.youtube.com/watch?v=GKbphzgo0sc)

1.  Standing Up from guard passing paths

    Get a sleeve and lapel grip and stand to pass while keeping the lapel arm stiff.
    Push open the guard and point your foot out while pressuring forward with your knee
    The other arm leaves the sleeve grip and "hikes" the knee to prevent a foot on my hip.

    1.  From DLR

        1.  OP has DLR hook

            1.  Backstep and pivot forward

                When you backsetup you are avoiding the far leg

            2.  Pivot back to HQ position and get on top of the far foot

                This move defeated the far foot on my leg/hip

2.  Torendo Pass

    Great detail on the torendo/bullfighter pass. If OP sits up when you grab the knees, step the the side and throw the legs down to that side. OP will be shelled to that side making it hard to pass. Hop to the far side that is undefended to take the back or side control.

3.  Deep Halfguard passing sequence

    1.  From deep halfguard, OP has the underhook for the backtake and an underhook on the far leg for the sweep.
    2.  First, cross your feet and sit on your underhooked foot and sitback.
    3.  Grab OPs bottom foot to avoid the backtake.
    4.  Stablize
    5.  Bring your arm in front to crossface and remove the underhook on your leg. Crossface hard and grab deep.
    6.  Switch hips and sprawl to a standard half guard
    7.  Walk across the OPs hips to get to quarter guard
    8.  To remove the foot from quarter guard&#x2026; Using head pressure and a crawling hand from the underhook, stretch out OPs posture. When OP is stretched out he cannot keep your foot when you kick it free.


<a id="org851980d"></a>

### [TD Brownbelt Series Part 2](https://www.youtube.com/watch?v=PJTrJjIV-CM)

This video is about the open half guard.
The "open half guard" "93 guard" is a halfguard with a foot on your hip and a knee shield.
Dan starts by explaining that he values positions based on how much weight he can put on the opponent. I think this is a great concept.

1.  Attack/Distract the leg: Get an ankle lock on the foot by pressing the toes into your torso while getting an RNC grip on the ankle. This can be used as a distraction if it does not work.
2.  Pass: Swim the arm in and grab the pants after pushing the knee down. This pinning the OPs heel to his butt is exactly the same as an excape from KOB where you trap the kneeling leg with an underhook grip. This is an underhook on the ankle instead of an overhook. The overhook on the ankle is next and it is used when OP has a sleeve grip.

2a. After the leg is pinned, turn the corner with your front side knee to get a knee into OPs hips.
2b. Grab behind his back with a crossface and backstep. You can pin the leg with your leg.
2c. Walk OP across his hips to finish the pass.

1.  Over-underpass: Establish the grip over his leg to grab his belt and break the grip on your sleeve.

3a. Keep your head to the OVER side of the over under to avoid getting stuffed.
3b. Get up on your toes and walk OP to the Over side to limit movement. (This changing his hip position is a key theme) :theme
3c. Raise your leg to escape half guard to side control nad put he leg under OPs legs to keep his hips out of play.

(This is similar to the passing concept that Jason Scully showed me at the Montreal seminar. Finishing the pass with a foot posted and OPs legs hanging off of your leg prevents scrambles)

I had to stop the video [here](https://youtu.be/PJTrJjIV-CM?t=6m49s) on 12/3 so I can get to class :)


<a id="org24455c2"></a>

### [TD Brownbelt Series Part 3](https://www.youtube.com/watch?v=UUqH4rb7WBc)


<a id="org479639c"></a>

### [TD Brownbelt Series Part 4](https://www.youtube.com/watch?v=3H2gpKUHq10)


<a id="org9217510"></a>

### [TD Brownbelt Series Part 5](https://www.youtube.com/watch?v=3qFwa0ZhV2g)


<a id="org08d4ee6"></a>

### [TD Brownbelt Series Part 6](https://www.youtube.com/watch?v=sm8NKHFlPNI)


<a id="org451ea59"></a>

### [TD Brownbelt Series Part 7](https://www.youtube.com/watch?v=MtPki5X7mrU)


<a id="org7f78e3a"></a>

### [TD Brownbelt Series Part 8](https://www.youtube.com/watch?v=L19elzK79hw)


<a id="orgf4afc1c"></a>

# Class Notes


<a id="org05dbbbb"></a>

## Topic taught Passing 93 Guard (halfguard with knee-sheild)     :TOPIC:

<span class="timestamp-wrapper"><span class="timestamp">[2016-12-03 Sat 11:07]</span></span>
In this class, I took notes and I will type them in later&#x2026;
