bjjplan.md


<a id="org40c7bf0"></a>

## Topic taught Chokes from TopBack/Escape from BottomBack     :TOPIC:

Chokes from Back - From Back control with over/under keep the bottom hand covering the top. Get a collar grip with the choking hand and use one of the following options for the other hand.

1.  Grab the lower lapel and complete the classic collar choke
2.  Switch to an eziekiel (spelling?) choke by bringing the non-choking hand behind the head and grabbing the sleeve
3.  If you have the collar grip, switch to the leg for the bow and arrow choke
4.  From bow and arrow, switch to moving the arm behind the arm/head to finish the choke
5.  Feed your Gi lapel from under OPs armpit to the choking hand - setup the same bow and arrow choke or under arm finish.

Escape from Back Control

1.  Turn torward the choking arm and post on your hand to get to turtle
2.  Raise your hips to try to make OP post a hand.
3.  Grab the hand and move push it to the other side of you head
4.  Roll to the side away from OP to get your shoulders on the mat
5.  Grab OPs knee with both hands to prevent the mount and get top position
6.  Underhook the leg while allowing mount to sneak out of the back door (so to speak)

No rolling today, Just positional sparring from positions

Drilling:
Drilled Roger Gracie Guard and Vale Tudo Gaurd together. If I cannot get the Vale Tudo setup I try to drag the arm across for the Roger Gracie setup and that ususally leads to a scramble that allows the Vale Tudo setup. The constant work makes it hard for OP to work on thier game.

Drilled Stone Squirrel w/Mac
Worked with light resistance and worked on several options
Sucessfully framed up into Stone Squirrel by bumping and raising my arms up.
Try to get my knee in to re-guard
Roll for the hip heist or high single depending on where OP goes

I was able to work and chain together some escapes but I did not have heavy resistance

Drilled DLR pass w/Isaac

1.  Starting from DLR
2.  Get knee grip and lapel grip
3.  Stepback bringing the knee grip with me to turn OP
4.  Turn back in to lose the DLR hook and setup Mission Control
5.  Control "hike" the top leg for control
6.  Swim down to establish a knee ride on the bottom thigh and pressure the top leg
7.  Get a back grip and collar grip
8.  Switch the knee ride from one to the other and post out the far leg
9.  Pin the top leg at the calf with the posted leg
10. Switch hips to setup the hop to the far side
11. Hop to the far side and end with KOB or hip
12. Be ready to switch if OP shrimps

There is a lot of details but it started to make sense as I worked through some reps. I need to get this practice in every week/day

<span class="timestamp-wrapper"><span class="timestamp">[2016-12-05 Mon 20:47]</span></span>


<a id="orgf4ef39d"></a>

## Topic taught Passing Scissor Guard with leg weave and pressure     :TOPIC:


<a id="org8e05dbd"></a>

### Steps

1.  Establish the leg weave while pinning the bottom arm with a sleeve grip.
2.  Sprawl and use shoulder pressure to collapse OPs legs together
3.  As you walk around the legs using head pressure, pull the top leg to prevent a hip escape


<a id="org4addae4"></a>

### Drilling:

Drilled the move from the class with resistance. I had trouble clearing the legs and I could not hop to the far side either. I think I needed to move to the leg switch and to pin the leg better.


<a id="org820a89b"></a>

### Rolling

I rolled in a few rounds from guard switching top and bottom. I had an interesting escape from a triangle. I tried to turn into the hips from my trapped arm side but I was not able to get a good angle. I switched to the feet in the armpit sitback escape I was only able to get the untrapped arm side foot in the armpit but the escape worked when I used both legs. When the triangle broke open, I ended up in a pass by keeping my arm that I used to get out of the triangle.

From guard I was able to pull the arm across to take the back with white belts. I had a harder time getting into Vale Tudo Guard and the Roger Gracie guard setup. I was able to keep my guard and threaten but I think I needed to push harder on my first move to setup my second and third moves. I show the sweep attempt too much before I go for it and I need to get them moving so I will have momentum to use.

<span class="timestamp-wrapper"><span class="timestamp">[2016-12-07 Wed 22:07]</span></span>


<a id="org076b93a"></a>

## Topic taught Arm drag from closed guard with lapel over arm grip - Julio's class     :TOPIC:

Lesson

1.  From closed guard, open the lapel and get a cross grip over OPs arm with a thumb up grip.
2.  Grab the wrist of the same arm with your same side hand
3.  Bridge and break the grip while straigtening you arm
4.  Pull the arm to the side while using your legs to break his posture to the side
5.  Shrimp out and reach over OPs head and hand yourself the lapel

Options:

1.  Reach behind the other arm to finish the choke
2.  Underhook the leg to get the flower sweep
3.  Climb the guard high and setup the armbar

Drilling:
Drilled [VanGuard Gym Side Control Escape System](bjjplan.md) with Kyle. I got reps in with the stone squirrel to guard recovery and to hip heist single leg. When drilling it live I had a real hard time. Kyle would sit through to Kesa with a grip on my shoulder. I would need to switch to the armpit push escape but Kyle would step over my head and work the inverted triangle.
Kyle showed me a good concept to work that was very helpful. \*\* I need to work to get a same side sleeve grip. I started drilling with this and it made everything much easier. In order to set up the grip I am gripping the elbow while working the other escapes. If that arm moves I need to double up on that grip and push while I shrimp.
I was able to get one reversal completed from that position when fighting for the sleeve everything else opened up.

I drilled the Vale Tudo Guard / RG guard but only one or two reps and today's class was good practice for this same type of work.
<span class="timestamp-wrapper"><span class="timestamp">[2016-12-12 Mon 20:52]</span></span>
